{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base and utility setup defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, footer, and navigation steps for the multi-page resume builder.",
  "frontend/src/features/editor/ActionVerbHelper.tsx": "Dropdown UI component listing action verbs and applying a selected verb via callback.",
  "frontend/src/features/editor/actionVerbs.ts": "Provides strong action verbs and a function to replace weak phrases or prepend verbs in text.",
  "frontend/src/features/editor/certifications.ts": "Helpers for parsing, formatting, and normalizing certification strings from text inputs.",
  "frontend/src/features/editor/RepeatableSectionControls.tsx": "Reusable control rendering repeatable form sections with editing, reordering, and deletion functionality.",
  "frontend/src/features/editor/ResumeEditorForm.tsx": "Main resume editor UI component managing form inputs, local state sync, and store updates for all resume sections.",
  "frontend/src/features/editor/skills.ts": "Utility functions for parsing, formatting, and normalizing skill lists from comma‑separated input.",
  "frontend/src/features/editor/types.ts": "Type definitions for resume data structures including personal info, experience, education, and projects.",
  "frontend/src/features/editor/validation.ts": "Validates resume data and returns simple field-level error messages.",
  "frontend/src/features/export/pdfExport.ts": "Generates a printable PDF by cloning an element into a new window and invoking the browser's print API.",
  "frontend/src/features/headline/headlineSuggestionEngine.ts": "Creates headline suggestions using skills, experience, and predefined patterns.",
  "frontend/src/features/headline/HeadlineSuggestionsPanel.tsx": "Displays generated headline suggestions and lets users apply them to their resume.",
  "frontend/src/features/keywords/keywordSuggestionEngine.ts": "Maps input text to related keywords and provides insertion logic with optional cursor support.",
  "frontend/src/features/keywords/KeywordSuggestionsPanel.tsx": "Shows keyword suggestions with expand/collapse behavior and allows inserting selected keywords.",
  "frontend/src/features/tips/InlineTip.tsx": "Collapsible inline tip component displaying contextual advice with toggle controls.",
  "frontend/src/features/tips/tipContent.ts": "Defines structured resume-writing tips for each section and exports a corresponding type.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context providing login, logout, and identity state handling via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains no logic; placeholder file indicating no backend queries are used.",
  "frontend/src/index.css": "Sets Tailwind layers, theme variables, dark-mode styles, and print rules for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ResumeEditorPage.tsx": "Renders the resume editor with a form and live preview panel based on the selected template.",
  "frontend/src/pages/ResumePreviewPage.tsx": "Shows a full resume preview and supports PDF download using the chosen template and data.",
  "frontend/src/pages/TemplateGalleryPage.tsx": "Displays categorized resume templates and lets users select one before proceeding to the editor.",
  "frontend/src/state/resumeStore.ts": "Defines a Zustand store for managing resume data, template selection, section order, and update helpers with normalization utilities.",
  "frontend/src/templates/BaseResumeTemplate.tsx": "Renders resume sections based on current store section order, normalizing skills and certifications and outputting structured JSX.",
  "frontend/src/templates/renderers/index.ts": "Exports a function returning the appropriate resume template renderer, currently defaulting to the base template.",
  "frontend/src/templates/templateCatalog.ts": "Provides metadata for all resume templates grouped by category, including IDs, names, descriptions, and features.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins used by the frontend.",
  "project_state.json": "Describes project state, features, and requirements for implementing live resume preview and removing manual submit behavior."
}